# Реализовать функцию, принимающую два числа
# (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя,
# предусмотреть обработку ситуации деления на ноль.

def div(*args):
    try:
        num1 = int(input("Введите первое число "))
        num2 = int(input("Введите второе число "))
        res = num1 / num2
    except ValueError:
        return 'Ошибка значения'
    except ZeroDivisionError:
        return "Неправильный число! Вы не можете использовать ноль в качестве д"
    return res

    if num2 != 0:
        return num1 / num2
    else:
        print("Неправильный номер! Делитель не может быть нулевым")


print(f'Результат {div()}')