# Программа запрашивает у пользователя строку чисел, разделенных
#  пробелом. При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделенных пробелом и
# снова нажать Enter. Сумма вновь введенных чисел будет добавляться
# к уже подсчитанной сумме. Но если вместо числа вводится специальный
# символ, выполнение программы завершается. Если специальный символ
# введен после нескольких чисел, то вначале нужно добавить сумму этих
# чисел к полученной ранее сумме и после этого завершить программу.

def my_sum():
    res_sum = 0
    ex = False
    while ex == False:
        number = input('Введите числа (или для прекращения введите "Q(q)") - ').split()
        res = 0
        for el in range(len(number)):
            if number[el] == 'q' or number[el] == 'Q':
                ex = True
                break
            else:
                res = res + int(number[el])
        res_sum = res_sum + res
        print(f'Текущая сумма {res_sum}')
    print(f'Ваша окончательная сумма {res_sum}')

my_sum()